```hcl
07:49:33.793 INFO   The runner at . will be processed in the following order for command plan:
Group 1
- Unit ./iam
- Unit ./iam-policy
- Unit ./s3

Group 2
- Unit ./iam-user


module.s3_bucket.data.aws_caller_identity.current: Reading...
module.s3_bucket.data.aws_partition.current: Reading...
module.s3_backup_bucket.data.aws_region.current: Reading...
module.s3_bucket.data.aws_region.current: Reading...
module.s3_backup_bucket.data.aws_caller_identity.current: Reading...
module.s3_backup_bucket.data.aws_partition.current: Reading...
module.s3_backup_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_backup_bucket.data.aws_region.current: Read complete after 0s [id=ap-south-1]
module.s3_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_bucket.data.aws_region.current: Read complete after 0s [id=ap-south-1]
module.psp_1_backup_iam_user.aws_iam_user.this[0]: Refreshing state... [id=psp-1-backup]
module.psp_1_backup_iam_policy.aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::587210147621:policy/psp-1-backup]
module.iam_policy["ecr_user"].aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::587210147621:policy/ecr_user]
module.iam_policy["psp-1-backup-s3"].aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::587210147621:policy/psp-1-backup-s3]
module.s3_backup_bucket.data.aws_caller_identity.current: Read complete after 0s [id=587210147621]
module.psp_1_backup_iam_user.aws_iam_access_key.this_no_pgp[0]: Refreshing state... [id=AKIAYRODTY4S3BO6XS2E]
module.psp_1_backup_iam_user.aws_iam_user_policy_attachment.this["0"]: Refreshing state... [id=psp-1-backup-20260108073702379100000001]
module.s3_bucket.data.aws_caller_identity.current: Read complete after 1s [id=587210147621]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.s3_backup_bucket.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "psp-1-backup"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = "ap-south-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Application" = "medcore"
          + "Contacts"    = "pranat.pattankude@corazonkare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Test"
          + "Owner"       = "terraform"
        }
      + tags_all                    = {
          + "Application" = "medcore"
          + "Contacts"    = "pranat.pattankude@corazonkare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Test"
          + "Owner"       = "terraform"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_backup_bucket.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "ap-south-1"
      + restrict_public_buckets = true
    }

  # module.s3_bucket.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "psp-tfstate"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = "ap-south-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Application" = "medcore"
          + "Contacts"    = "pranat.pattankude@corazonkare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Test"
          + "Owner"       = "terraform"
        }
      + tags_all                    = {
          + "Application" = "medcore"
          + "Contacts"    = "pranat.pattankude@corazonkare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Test"
          + "Owner"       = "terraform"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "ap-south-1"
      + restrict_public_buckets = true
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf-plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf-plan"
module.iam_user["psp-1-backup-s3"].aws_iam_user.this[0]: Refreshing state... [id=psp-1-backup-s3]
module.iam_user["ecr_user"].aws_iam_user.this[0]: Refreshing state... [id=ecr_user]
module.iam_user["ecr_user"].aws_iam_access_key.this_no_pgp[0]: Refreshing state... [id=AKIAYRODTY4S5PD44K6X]
module.iam_user["psp-1-backup-s3"].aws_iam_access_key.this_no_pgp[0]: Refreshing state... [id=AKIAYRODTY4SXB5T46HA]
module.iam_user["ecr_user"].aws_iam_user_policy_attachment.this["0"]: Refreshing state... [id=ecr_user-20260108072322897600000001]
module.iam_user["psp-1-backup-s3"].aws_iam_user_policy_attachment.this["0"]: Refreshing state... [id=psp-1-backup-s3-20260108072322971200000002]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

<!-- thollander/actions-comment-pull-request "file" -->